{"modelTopology": {"library": {}, "versions": {}, "node": [{"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_5/bias_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_5/conv2d_filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "upconv/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "upconv/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/strided_slice_9/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "upconv/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/Slice_2/size/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/bias_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_4/conv2d_filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_3/bias_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_3/conv2d_filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_2/bias_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_2/conv2d_filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_1/bias_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_1/conv2d_filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_0/bias_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_0/conv2d_filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "upconv/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "upconv/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/Slice_3/begin/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/Slice_2/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "upconv/conv2d_transpose_filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "upconv/conv2d_transpose/output_shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/Shape", "op": "Shape", "input": ["input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/strided_slice_2", "op": "StridedSlice", "input": ["conv2d_bias_0/Shape", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/strided_slice_1", "op": "StridedSlice", "input": ["conv2d_bias_0/Shape", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/strided_slice", "op": "StridedSlice", "input": ["conv2d_bias_0/Shape", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/strided_slice_3", "op": "StridedSlice", "input": ["conv2d_bias_0/Shape", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/Slice/size", "op": "Pack", "input": ["conv2d_bias_0/strided_slice", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_0/strided_slice_1", "conv2d_bias_0/strided_slice_2"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_0/sub", "op": "Sub", "input": ["conv2d_bias_0/strided_slice_3", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/Slice", "op": "Slice", "input": ["input", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_0/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_0/Slice_1/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_0/sub", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_0/Slice_1", "op": "Slice", "input": ["input", "conv2d_bias_0/Slice_1/begin", "conv2d_bias_0/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_0/concat", "op": "ConcatV2", "input": ["conv2d_bias_0/Slice", "input", "conv2d_bias_0/Slice_1", "conv2d_bias_5/Slice_2/size/2"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "conv2d_bias_0/Shape_1", "op": "Shape", "input": ["conv2d_bias_0/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/strided_slice_9", "op": "StridedSlice", "input": ["conv2d_bias_0/Shape_1", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/strided_slice_8", "op": "StridedSlice", "input": ["conv2d_bias_0/Shape_1", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/strided_slice_7", "op": "StridedSlice", "input": ["conv2d_bias_0/Shape_1", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "conv2d_bias_0/strided_slice_10", "op": "StridedSlice", "input": ["conv2d_bias_0/Shape_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/Slice_2/size", "op": "Pack", "input": ["conv2d_bias_0/strided_slice_7", "conv2d_bias_0/strided_slice_8", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_0/strided_slice_9"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_0/sub_1", "op": "Sub", "input": ["conv2d_bias_0/strided_slice_10", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_0/Slice_2", "op": "Slice", "input": ["conv2d_bias_0/concat", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_0/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_0/Slice_3/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_0/sub_1", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_0/Slice_3", "op": "Slice", "input": ["conv2d_bias_0/concat", "conv2d_bias_0/Slice_3/begin", "conv2d_bias_0/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_0/concat_1", "op": "ConcatV2", "input": ["conv2d_bias_0/Slice_2", "conv2d_bias_0/concat", "conv2d_bias_0/Slice_3", "upconv/mul/y"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "conv2d_bias_0/conv2d", "op": "Conv2D", "input": ["conv2d_bias_0/concat_1", "conv2d_bias_0/conv2d_filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv2d_bias_0/bias_add", "op": "BiasAdd", "input": ["conv2d_bias_0/conv2d", "conv2d_bias_0/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "leaky_relu_0", "op": "LeakyRelu", "input": ["conv2d_bias_0/bias_add"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "conv2d_bias_1/Shape", "op": "Shape", "input": ["leaky_relu_0"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/strided_slice_2", "op": "StridedSlice", "input": ["conv2d_bias_1/Shape", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/strided_slice_1", "op": "StridedSlice", "input": ["conv2d_bias_1/Shape", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/strided_slice", "op": "StridedSlice", "input": ["conv2d_bias_1/Shape", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/strided_slice_3", "op": "StridedSlice", "input": ["conv2d_bias_1/Shape", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/Slice/size", "op": "Pack", "input": ["conv2d_bias_1/strided_slice", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_1/strided_slice_1", "conv2d_bias_1/strided_slice_2"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "conv2d_bias_1/sub", "op": "Sub", "input": ["conv2d_bias_1/strided_slice_3", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/Slice", "op": "Slice", "input": ["leaky_relu_0", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_1/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_1/Slice_1/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_1/sub", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_1/Slice_1", "op": "Slice", "input": ["leaky_relu_0", "conv2d_bias_1/Slice_1/begin", "conv2d_bias_1/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_1/concat", "op": "ConcatV2", "input": ["conv2d_bias_1/Slice", "leaky_relu_0", "conv2d_bias_1/Slice_1", "conv2d_bias_5/Slice_2/size/2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/Shape_1", "op": "Shape", "input": ["conv2d_bias_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/strided_slice_9", "op": "StridedSlice", "input": ["conv2d_bias_1/Shape_1", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "conv2d_bias_1/strided_slice_8", "op": "StridedSlice", "input": ["conv2d_bias_1/Shape_1", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/strided_slice_7", "op": "StridedSlice", "input": ["conv2d_bias_1/Shape_1", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/strided_slice_10", "op": "StridedSlice", "input": ["conv2d_bias_1/Shape_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/Slice_2/size", "op": "Pack", "input": ["conv2d_bias_1/strided_slice_7", "conv2d_bias_1/strided_slice_8", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_1/strided_slice_9"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_1/sub_1", "op": "Sub", "input": ["conv2d_bias_1/strided_slice_10", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/Slice_2", "op": "Slice", "input": ["conv2d_bias_1/concat", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_1/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_1/Slice_3/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_1/sub_1", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_1/Slice_3", "op": "Slice", "input": ["conv2d_bias_1/concat", "conv2d_bias_1/Slice_3/begin", "conv2d_bias_1/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_1/concat_1", "op": "ConcatV2", "input": ["conv2d_bias_1/Slice_2", "conv2d_bias_1/concat", "conv2d_bias_1/Slice_3", "upconv/mul/y"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_1/conv2d", "op": "Conv2D", "input": ["conv2d_bias_1/concat_1", "conv2d_bias_1/conv2d_filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "conv2d_bias_1/bias_add", "op": "BiasAdd", "input": ["conv2d_bias_1/conv2d", "conv2d_bias_1/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "leaky_relu_1", "op": "LeakyRelu", "input": ["conv2d_bias_1/bias_add"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "conv2d_bias_2/Shape", "op": "Shape", "input": ["leaky_relu_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/strided_slice_2", "op": "StridedSlice", "input": ["conv2d_bias_2/Shape", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/strided_slice_1", "op": "StridedSlice", "input": ["conv2d_bias_2/Shape", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/strided_slice", "op": "StridedSlice", "input": ["conv2d_bias_2/Shape", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/strided_slice_3", "op": "StridedSlice", "input": ["conv2d_bias_2/Shape", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/Slice/size", "op": "Pack", "input": ["conv2d_bias_2/strided_slice", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_2/strided_slice_1", "conv2d_bias_2/strided_slice_2"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_2/sub", "op": "Sub", "input": ["conv2d_bias_2/strided_slice_3", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/Slice", "op": "Slice", "input": ["leaky_relu_1", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_2/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_2/Slice_1/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_2/sub", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_2/Slice_1", "op": "Slice", "input": ["leaky_relu_1", "conv2d_bias_2/Slice_1/begin", "conv2d_bias_2/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_2/concat", "op": "ConcatV2", "input": ["conv2d_bias_2/Slice", "leaky_relu_1", "conv2d_bias_2/Slice_1", "conv2d_bias_5/Slice_2/size/2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/Shape_1", "op": "Shape", "input": ["conv2d_bias_2/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/strided_slice_9", "op": "StridedSlice", "input": ["conv2d_bias_2/Shape_1", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/strided_slice_8", "op": "StridedSlice", "input": ["conv2d_bias_2/Shape_1", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/strided_slice_7", "op": "StridedSlice", "input": ["conv2d_bias_2/Shape_1", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/strided_slice_10", "op": "StridedSlice", "input": ["conv2d_bias_2/Shape_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/Slice_2/size", "op": "Pack", "input": ["conv2d_bias_2/strided_slice_7", "conv2d_bias_2/strided_slice_8", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_2/strided_slice_9"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_2/sub_1", "op": "Sub", "input": ["conv2d_bias_2/strided_slice_10", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/Slice_2", "op": "Slice", "input": ["conv2d_bias_2/concat", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_2/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_2/Slice_3/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_2/sub_1", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_2/Slice_3", "op": "Slice", "input": ["conv2d_bias_2/concat", "conv2d_bias_2/Slice_3/begin", "conv2d_bias_2/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_2/concat_1", "op": "ConcatV2", "input": ["conv2d_bias_2/Slice_2", "conv2d_bias_2/concat", "conv2d_bias_2/Slice_3", "upconv/mul/y"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_2/conv2d", "op": "Conv2D", "input": ["conv2d_bias_2/concat_1", "conv2d_bias_2/conv2d_filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv2d_bias_2/bias_add", "op": "BiasAdd", "input": ["conv2d_bias_2/conv2d", "conv2d_bias_2/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "leaky_relu_2", "op": "LeakyRelu", "input": ["conv2d_bias_2/bias_add"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "conv2d_bias_3/Shape", "op": "Shape", "input": ["leaky_relu_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/strided_slice_2", "op": "StridedSlice", "input": ["conv2d_bias_3/Shape", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/strided_slice_1", "op": "StridedSlice", "input": ["conv2d_bias_3/Shape", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/strided_slice", "op": "StridedSlice", "input": ["conv2d_bias_3/Shape", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/strided_slice_3", "op": "StridedSlice", "input": ["conv2d_bias_3/Shape", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/Slice/size", "op": "Pack", "input": ["conv2d_bias_3/strided_slice", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_3/strided_slice_1", "conv2d_bias_3/strided_slice_2"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "conv2d_bias_3/sub", "op": "Sub", "input": ["conv2d_bias_3/strided_slice_3", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/Slice", "op": "Slice", "input": ["leaky_relu_2", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_3/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_3/Slice_1/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_3/sub", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "conv2d_bias_3/Slice_1", "op": "Slice", "input": ["leaky_relu_2", "conv2d_bias_3/Slice_1/begin", "conv2d_bias_3/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_3/concat", "op": "ConcatV2", "input": ["conv2d_bias_3/Slice", "leaky_relu_2", "conv2d_bias_3/Slice_1", "conv2d_bias_5/Slice_2/size/2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/Shape_1", "op": "Shape", "input": ["conv2d_bias_3/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/strided_slice_9", "op": "StridedSlice", "input": ["conv2d_bias_3/Shape_1", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/strided_slice_8", "op": "StridedSlice", "input": ["conv2d_bias_3/Shape_1", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "conv2d_bias_3/strided_slice_7", "op": "StridedSlice", "input": ["conv2d_bias_3/Shape_1", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/strided_slice_10", "op": "StridedSlice", "input": ["conv2d_bias_3/Shape_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/Slice_2/size", "op": "Pack", "input": ["conv2d_bias_3/strided_slice_7", "conv2d_bias_3/strided_slice_8", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_3/strided_slice_9"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_3/sub_1", "op": "Sub", "input": ["conv2d_bias_3/strided_slice_10", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/Slice_2", "op": "Slice", "input": ["conv2d_bias_3/concat", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_3/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_3/Slice_3/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_3/sub_1", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_3/Slice_3", "op": "Slice", "input": ["conv2d_bias_3/concat", "conv2d_bias_3/Slice_3/begin", "conv2d_bias_3/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_3/concat_1", "op": "ConcatV2", "input": ["conv2d_bias_3/Slice_2", "conv2d_bias_3/concat", "conv2d_bias_3/Slice_3", "upconv/mul/y"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_3/conv2d", "op": "Conv2D", "input": ["conv2d_bias_3/concat_1", "conv2d_bias_3/conv2d_filter"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv2d_bias_3/bias_add", "op": "BiasAdd", "input": ["conv2d_bias_3/conv2d", "conv2d_bias_3/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "leaky_relu_3", "op": "LeakyRelu", "input": ["conv2d_bias_3/bias_add"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "conv2d_bias_4/Shape", "op": "Shape", "input": ["leaky_relu_3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/strided_slice_2", "op": "StridedSlice", "input": ["conv2d_bias_4/Shape", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/strided_slice_1", "op": "StridedSlice", "input": ["conv2d_bias_4/Shape", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/strided_slice", "op": "StridedSlice", "input": ["conv2d_bias_4/Shape", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/strided_slice_3", "op": "StridedSlice", "input": ["conv2d_bias_4/Shape", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/Slice/size", "op": "Pack", "input": ["conv2d_bias_4/strided_slice", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_4/strided_slice_1", "conv2d_bias_4/strided_slice_2"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "conv2d_bias_4/sub", "op": "Sub", "input": ["conv2d_bias_4/strided_slice_3", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/Slice", "op": "Slice", "input": ["leaky_relu_3", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_4/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_4/Slice_1/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_4/sub", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_4/Slice_1", "op": "Slice", "input": ["leaky_relu_3", "conv2d_bias_4/Slice_1/begin", "conv2d_bias_4/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_4/concat", "op": "ConcatV2", "input": ["conv2d_bias_4/Slice", "leaky_relu_3", "conv2d_bias_4/Slice_1", "conv2d_bias_5/Slice_2/size/2"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/Shape_1", "op": "Shape", "input": ["conv2d_bias_4/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/strided_slice_9", "op": "StridedSlice", "input": ["conv2d_bias_4/Shape_1", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/strided_slice_8", "op": "StridedSlice", "input": ["conv2d_bias_4/Shape_1", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/strided_slice_7", "op": "StridedSlice", "input": ["conv2d_bias_4/Shape_1", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/strided_slice_10", "op": "StridedSlice", "input": ["conv2d_bias_4/Shape_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/Slice_2/size", "op": "Pack", "input": ["conv2d_bias_4/strided_slice_7", "conv2d_bias_4/strided_slice_8", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_4/strided_slice_9"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_4/sub_1", "op": "Sub", "input": ["conv2d_bias_4/strided_slice_10", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/Slice_2", "op": "Slice", "input": ["conv2d_bias_4/concat", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_4/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_4/Slice_3/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_4/sub_1", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_4/Slice_3", "op": "Slice", "input": ["conv2d_bias_4/concat", "conv2d_bias_4/Slice_3/begin", "conv2d_bias_4/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_4/concat_1", "op": "ConcatV2", "input": ["conv2d_bias_4/Slice_2", "conv2d_bias_4/concat", "conv2d_bias_4/Slice_3", "upconv/mul/y"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_4/conv2d", "op": "Conv2D", "input": ["conv2d_bias_4/concat_1", "conv2d_bias_4/conv2d_filter"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv2d_bias_4/bias_add", "op": "BiasAdd", "input": ["conv2d_bias_4/conv2d", "conv2d_bias_4/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "leaky_relu_4", "op": "LeakyRelu", "input": ["conv2d_bias_4/bias_add"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "conv2d_bias_5/Shape", "op": "Shape", "input": ["leaky_relu_4"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/strided_slice_2", "op": "StridedSlice", "input": ["conv2d_bias_5/Shape", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/strided_slice_1", "op": "StridedSlice", "input": ["conv2d_bias_5/Shape", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/strided_slice", "op": "StridedSlice", "input": ["conv2d_bias_5/Shape", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/strided_slice_3", "op": "StridedSlice", "input": ["conv2d_bias_5/Shape", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/Slice/size", "op": "Pack", "input": ["conv2d_bias_5/strided_slice", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_5/strided_slice_1", "conv2d_bias_5/strided_slice_2"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_5/sub", "op": "Sub", "input": ["conv2d_bias_5/strided_slice_3", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/Slice", "op": "Slice", "input": ["leaky_relu_4", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_5/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_5/Slice_1/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/sub", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_5/Slice_1", "op": "Slice", "input": ["leaky_relu_4", "conv2d_bias_5/Slice_1/begin", "conv2d_bias_5/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_5/concat", "op": "ConcatV2", "input": ["conv2d_bias_5/Slice", "leaky_relu_4", "conv2d_bias_5/Slice_1", "conv2d_bias_5/Slice_2/size/2"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "conv2d_bias_5/Shape_1", "op": "Shape", "input": ["conv2d_bias_5/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/strided_slice_9", "op": "StridedSlice", "input": ["conv2d_bias_5/Shape_1", "upconv/strided_slice_2/stack_1", "conv2d_bias_5/strided_slice_9/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/strided_slice_8", "op": "StridedSlice", "input": ["conv2d_bias_5/Shape_1", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/strided_slice_7", "op": "StridedSlice", "input": ["conv2d_bias_5/Shape_1", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/strided_slice_10", "op": "StridedSlice", "input": ["conv2d_bias_5/Shape_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/Slice_2/size", "op": "Pack", "input": ["conv2d_bias_5/strided_slice_7", "conv2d_bias_5/strided_slice_8", "conv2d_bias_5/Slice_2/size/2", "conv2d_bias_5/strided_slice_9"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_5/sub_1", "op": "Sub", "input": ["conv2d_bias_5/strided_slice_10", "conv2d_bias_5/Slice_2/size/2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv2d_bias_5/Slice_2", "op": "Slice", "input": ["conv2d_bias_5/concat", "conv2d_bias_5/Slice_2/begin", "conv2d_bias_5/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_5/Slice_3/begin", "op": "Pack", "input": ["conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/Slice_3/begin/0", "conv2d_bias_5/sub_1", "conv2d_bias_5/Slice_3/begin/0"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "conv2d_bias_5/Slice_3", "op": "Slice", "input": ["conv2d_bias_5/concat", "conv2d_bias_5/Slice_3/begin", "conv2d_bias_5/Slice_2/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_bias_5/concat_1", "op": "ConcatV2", "input": ["conv2d_bias_5/Slice_2", "conv2d_bias_5/concat", "conv2d_bias_5/Slice_3", "upconv/mul/y"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "conv2d_bias_5/conv2d", "op": "Conv2D", "input": ["conv2d_bias_5/concat_1", "conv2d_bias_5/conv2d_filter"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "conv2d_bias_5/bias_add", "op": "BiasAdd", "input": ["conv2d_bias_5/conv2d", "conv2d_bias_5/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "leaky_relu_5", "op": "LeakyRelu", "input": ["conv2d_bias_5/bias_add"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "upconv/Shape", "op": "Shape", "input": ["leaky_relu_5"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "upconv/strided_slice_2", "op": "StridedSlice", "input": ["upconv/Shape", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "upconv/strided_slice_1", "op": "StridedSlice", "input": ["upconv/Shape", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "upconv/strided_slice", "op": "StridedSlice", "input": ["upconv/Shape", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "upconv/mul_1", "op": "Mul", "input": ["upconv/strided_slice_2", "upconv/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "upconv/mul", "op": "Mul", "input": ["upconv/strided_slice_1", "upconv/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "upconv/conv2d_transpose/output_shape", "op": "Pack", "input": ["upconv/strided_slice", "upconv/mul", "upconv/mul_1", "upconv/conv2d_transpose/output_shape/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "upconv/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["upconv/conv2d_transpose/output_shape", "upconv/conv2d_transpose_filter", "leaky_relu_5"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "output/Minimum", "op": "Minimum", "input": ["upconv/conv2d_transpose", "output/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output", "op": "Maximum", "input": ["output/Minimum", "output/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["output"], "attr": {"T": {"list": {"type": ["DT_FLOAT"]}}}}]}, "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "graph-model", "generatedBy": "2.0.0-dev20190322", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"shape": [], "name": "output/y", "dtype": "float32"}, {"shape": [], "name": "output/Minimum/y", "dtype": "float32"}, {"shape": [256], "name": "conv2d_bias_5/bias_value", "dtype": "float32"}, {"shape": [3, 3, 128, 256], "name": "conv2d_bias_5/conv2d_filter", "dtype": "float32"}, {"shape": [], "name": "upconv/mul/y", "dtype": "int32"}, {"shape": [1], 