{"modelTopology": {"versions": {}, "library": {}, "node": [{"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "strided_slice/stack_1"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "strided_slice_1/stack_1"}, {"op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}, "name": "strided_slice/stack"}, {"op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "mul/y"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}, "name": "conv2d_bias_0/conv2d_filter"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "conv2d_bias_0/bias_value"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}, "name": "conv2d_bias_1/conv2d_filter"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}, "name": "conv2d_bias_1/bias_value"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}, "name": "conv2d_bias_2/conv2d_filter"}, {"op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "conv2d_bias_2/bias_value"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "conv2d_bias_3/conv2d_filter"}, {"op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "conv2d_bias_3/bias_value"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}, "name": "conv2d_bias_4/conv2d_filter"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "conv2d_bias_4/bias_value"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "conv2d_bias_5/conv2d_filter"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "name": "conv2d_bias_5/bias_value"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "3"}]}}}}, "name": "conv2d_bias_7/conv2d_filter"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}, "name": "conv2d_bias_7/bias_value"}, {"op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}, "name": "output/Minimum/y"}, {"op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "output/y"}, {"op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}, "name": "input"}, {"op": "Shape", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["input"], "name": "Shape"}, {"op": "StridedSlice", "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}, "input": ["Shape", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack"], "name": "strided_slice"}, {"op": "StridedSlice", "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}, "input": ["Shape", "strided_slice/stack_1", "strided_slice_1/stack_1", "strided_slice/stack"], "name": "strided_slice_1"}, {"op": "Mul", "attr": {"T": {"type": "DT_INT32"}}, "input": ["strided_slice", "mul/y"], "name": "mul"}, {"op": "Mul", "attr": {"T": {"type": "DT_INT32"}}, "input": ["strided_slice_1", "mul/y"], "name": "mul_1"}, {"op": "Pack", "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["mul", "mul_1"], "name": "resize_nearest_neighbor/size"}, {"op": "ResizeNearestNeighbor", "attr": {"T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": false}, "align_corners": {"b": false}}, "input": ["input", "resize_nearest_neighbor/size"], "name": "resize_nearest_neighbor"}, {"op": "Conv2D", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}, "input": ["resize_nearest_neighbor", "conv2d_bias_0/conv2d_filter"], "name": "conv2d_bias_0/conv2d"}, {"op": "BiasAdd", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_0/conv2d", "conv2d_bias_0/bias_value"], "name": "conv2d_bias_0/bias_add"}, {"op": "LeakyRelu", "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "input": ["conv2d_bias_0/bias_add"], "name": "leaky_relu_0"}, {"op": "Conv2D", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "input": ["leaky_relu_0", "conv2d_bias_1/conv2d_filter"], "name": "conv2d_bias_1/conv2d"}, {"op": "BiasAdd", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_1/conv2d", "conv2d_bias_1/bias_value"], "name": "conv2d_bias_1/bias_add"}, {"op": "LeakyRelu", "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "input": ["conv2d_bias_1/bias_add"], "name": "leaky_relu_1"}, {"op": "Conv2D", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}, "input": ["leaky_relu_1", "conv2d_bias_2/conv2d_filter"], "name": "conv2d_bias_2/conv2d"}, {"op": "BiasAdd", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_2/conv2d", "conv2d_bias_2/bias_value"], "name": "conv2d_bias_2/bias_add"}, {"op": "LeakyRelu", "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "input": ["conv2d_bias_2/bias_add"], "name": "leaky_relu_2"}, {"op": "Conv2D", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}, "input": ["leaky_relu_2", "conv2d_bias_3/conv2d_filter"], "name": "conv2d_bias_3/conv2d"}, {"op": "BiasAdd", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_3/conv2d", "conv2d_bias_3/bias_value"], "name": "conv2d_bias_3/bias_add"}, {"op": "LeakyRelu", "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "input": ["conv2d_bias_3/bias_add"], "name": "leaky_relu_3"}, {"op": "Conv2D", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}, "input": ["leaky_relu_3", "conv2d_bias_4/conv2d_filter"], "name": "conv2d_bias_4/conv2d"}, {"op": "BiasAdd", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_4/conv2d", "conv2d_bias_4/bias_value"], "name": "conv2d_bias_4/bias_add"}, {"op": "LeakyRelu", "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "input": ["conv2d_bias_4/bias_add"], "name": "leaky_relu_4"}, {"op": "Conv2D", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}, "input": ["leaky_relu_4", "conv2d_bias_5/conv2d_filter"], "name": "conv2d_bias_5/conv2d"}, {"op": "BiasAdd", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_5/conv2d", "conv2d_bias_5/bias_value"], "name": "conv2d_bias_5/bias_add"}, {"op": "LeakyRelu", "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "input": ["conv2d_bias_5/bias_add"], "name": "leaky_relu_5"}, {"op": "Conv2D", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}}, "input": ["leaky_relu_5", "conv2d_bias_7/conv2d_filter"], "name": "conv2d_bias_7/conv2d"}, {"op": "BiasAdd", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_7/conv2d", "conv2d_bias_7/bias_value"], "name": "conv2d_bias_7/bias_add"}, {"op": "Minimum", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["conv2d_bias_7/bias_add", "output/Minimum/y"], "name": "output/Minimum"}, {"op": "Maximum", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["output/Minimum", "output/y"], "name": "output"}, {"op": "Identity", "attr": {"T": {"list": {"type": ["DT_FLOAT"]}}}, "input": ["output"], "name": "Identity"}]}, "generatedBy": "2.0.0-dev20190324", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"shape": [1], "dtype": "int32", "name": "strided_slice/stack_1"}, {"shape": [1], "dtype": "int32", "name": "strided_slice_1/stack_1"}, {"shape": [1], "dtype": "int32", "name": "strided_slice/stack"}, {"shape": [], "dtype": "int32", "name": "mul/y"}, {"shape": [3, 3, 3, 32], "dtype": "float32", "name": "conv2d_bias_0/conv2d_filter"}, {"shape": [32], "dtype": "float32", "name": "conv2d_bias_0/bias_value"}, {"shape": [3, 3, 32, 32], "dtype": "float32", "name": "conv2d_bias_1/conv2d_filter"}, {"shape": [32], "dtype": "float32", "name": "conv2d_bias_1/bias_value"}, {"shape": [3, 3, 32, 64], "dtype": "float32", "name": "conv2d_bias_2/conv2d_filter"}, {"shape": [64], "dtype": "float32", "name": "conv2d_bias_2/bias_value"}, {"shape": [3, 3, 64, 64], "dtype": "float32", "name": "conv2d_bias_3/conv2d_filter"}, {"shape": [64], "dtype": "float32", "name": "conv2d_bias_3/bias_value"}, {"shape": [3, 3, 64, 128], "dtype": "float32", "name": "conv2d_bias_4/conv2d_filter"}, {"shape": [128], "dtype": "float32", "name": "conv2d_bias_4/bias_value"}, {"shape": [3, 3, 128, 128], "dtype": "float32", "name": "conv2d_bias_5/conv2d_filter"}, {"shape": [128], "dtype": "float32", "name": "conv2d_bias_5/bias_value"}, {"shape": [3, 3, 128, 3], "dtype": "float32", "name": "conv2d_bias_7/conv2d_filter"}, {"shape": [3], "dtype": "float32", "name": "conv2d_bias_7/bias_value"}, {"shape": [], "dtype": "float32", "name": "output/Minimum/y"}, {"shape": [], "dtype": "float32", "name": "output/y"}]}], "format": "graph-model", "convertedBy": "TensorFlow.js Converter v1.0.1"}