{"generatedBy": "2.0.0-dev20190322", "modelTopology": {"library": {}, "node": [{"op": "Placeholder", "name": "input", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "output/y", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "output/Minimum/y", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_7/bias_value", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_7/conv2d_filter", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "3"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "mul/y", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "conv2d_bias_7/strided_slice_7/stack_1", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "conv2d_bias_7/strided_slice_9/stack_1", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "conv2d_bias_7/strided_slice_9/stack", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "conv2d_bias_7/Slice_2/size/2", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "conv2d_bias_5/bias_value", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_5/conv2d_filter", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_4/bias_value", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_4/conv2d_filter", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_3/bias_value", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_3/conv2d_filter", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_2/bias_value", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_2/conv2d_filter", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_1/bias_value", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_1/conv2d_filter", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_0/bias_value", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_0/conv2d_filter", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "conv2d_bias_7/strided_slice_8/stack_1", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "conv2d_bias_7/strided_slice_7/stack", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "conv2d_bias_7/Slice_3/begin/0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "conv2d_bias_7/Slice_2/begin", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}}}, {"op": "Shape", "name": "Shape", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["input"]}, {"op": "StridedSlice", "name": "strided_slice_1", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["Shape", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "strided_slice", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["Shape", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Mul", "name": "mul_1", "attr": {"T": {"type": "DT_INT32"}}, "input": ["strided_slice_1", "mul/y"]}, {"op": "Mul", "name": "mul", "attr": {"T": {"type": "DT_INT32"}}, "input": ["strided_slice", "mul/y"]}, {"op": "Pack", "name": "resize_nearest_neighbor/size", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}, "input": ["mul", "mul_1"]}, {"op": "ResizeNearestNeighbor", "name": "resize_nearest_neighbor", "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": false}}, "input": ["input", "resize_nearest_neighbor/size"]}, {"op": "Shape", "name": "conv2d_bias_0/Shape", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["resize_nearest_neighbor"]}, {"op": "StridedSlice", "name": "conv2d_bias_0/strided_slice_2", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_0/Shape", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_0/strided_slice_1", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_0/Shape", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_0/strided_slice", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_0/Shape", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_0/strided_slice_3", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_0/Shape", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_0/Slice/size", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_0/strided_slice", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_0/strided_slice_1", "conv2d_bias_0/strided_slice_2"]}, {"op": "Sub", "name": "conv2d_bias_0/sub", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_0/strided_slice_3", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_0/Slice", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["resize_nearest_neighbor", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_0/Slice/size"]}, {"op": "Pack", "name": "conv2d_bias_0/Slice_1/begin", "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_0/sub", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_0/Slice_1", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["resize_nearest_neighbor", "conv2d_bias_0/Slice_1/begin", "conv2d_bias_0/Slice/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_0/concat", "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}, "input": ["conv2d_bias_0/Slice", "resize_nearest_neighbor", "conv2d_bias_0/Slice_1", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Shape", "name": "conv2d_bias_0/Shape_1", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["conv2d_bias_0/concat"]}, {"op": "StridedSlice", "name": "conv2d_bias_0/strided_slice_9", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_0/Shape_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_0/strided_slice_8", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_0/Shape_1", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_0/strided_slice_7", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_0/Shape_1", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_0/strided_slice_10", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_0/Shape_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_0/Slice_2/size", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_0/strided_slice_7", "conv2d_bias_0/strided_slice_8", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_0/strided_slice_9"]}, {"op": "Sub", "name": "conv2d_bias_0/sub_1", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_0/strided_slice_10", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_0/Slice_2", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_0/concat", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_0/Slice_2/size"]}, {"op": "Pack", "name": "conv2d_bias_0/Slice_3/begin", "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_0/sub_1", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_0/Slice_3", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_0/concat", "conv2d_bias_0/Slice_3/begin", "conv2d_bias_0/Slice_2/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_0/concat_1", "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "input": ["conv2d_bias_0/Slice_2", "conv2d_bias_0/concat", "conv2d_bias_0/Slice_3", "mul/y"]}, {"op": "Conv2D", "name": "conv2d_bias_0/conv2d", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "input": ["conv2d_bias_0/concat_1", "conv2d_bias_0/conv2d_filter"]}, {"op": "BiasAdd", "name": "conv2d_bias_0/bias_add", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_0/conv2d", "conv2d_bias_0/bias_value"]}, {"op": "LeakyRelu", "name": "leaky_relu_0", "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}, "input": ["conv2d_bias_0/bias_add"]}, {"op": "Shape", "name": "conv2d_bias_1/Shape", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["leaky_relu_0"]}, {"op": "StridedSlice", "name": "conv2d_bias_1/strided_slice_2", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_1/Shape", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_1/strided_slice_1", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_1/Shape", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_1/strided_slice", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_1/Shape", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_1/strided_slice_3", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_1/Shape", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_1/Slice/size", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_1/strided_slice", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_1/strided_slice_1", "conv2d_bias_1/strided_slice_2"]}, {"op": "Sub", "name": "conv2d_bias_1/sub", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_1/strided_slice_3", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_1/Slice", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["leaky_relu_0", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_1/Slice/size"]}, {"op": "Pack", "name": "conv2d_bias_1/Slice_1/begin", "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_1/sub", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_1/Slice_1", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["leaky_relu_0", "conv2d_bias_1/Slice_1/begin", "conv2d_bias_1/Slice/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_1/concat", "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "input": ["conv2d_bias_1/Slice", "leaky_relu_0", "conv2d_bias_1/Slice_1", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Shape", "name": "conv2d_bias_1/Shape_1", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["conv2d_bias_1/concat"]}, {"op": "StridedSlice", "name": "conv2d_bias_1/strided_slice_9", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_1/Shape_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_1/strided_slice_8", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_1/Shape_1", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_1/strided_slice_7", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_1/Shape_1", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_1/strided_slice_10", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_1/Shape_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_1/Slice_2/size", "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_1/strided_slice_7", "conv2d_bias_1/strided_slice_8", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_1/strided_slice_9"]}, {"op": "Sub", "name": "conv2d_bias_1/sub_1", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_1/strided_slice_10", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_1/Slice_2", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_1/concat", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_1/Slice_2/size"]}, {"op": "Pack", "name": "conv2d_bias_1/Slice_3/begin", "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_1/sub_1", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_1/Slice_3", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_1/concat", "conv2d_bias_1/Slice_3/begin", "conv2d_bias_1/Slice_2/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_1/concat_1", "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}, "input": ["conv2d_bias_1/Slice_2", "conv2d_bias_1/concat", "conv2d_bias_1/Slice_3", "mul/y"]}, {"op": "Conv2D", "name": "conv2d_bias_1/conv2d", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}, "input": ["conv2d_bias_1/concat_1", "conv2d_bias_1/conv2d_filter"]}, {"op": "BiasAdd", "name": "conv2d_bias_1/bias_add", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_1/conv2d", "conv2d_bias_1/bias_value"]}, {"op": "LeakyRelu", "name": "leaky_relu_1", "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}, "input": ["conv2d_bias_1/bias_add"]}, {"op": "Shape", "name": "conv2d_bias_2/Shape", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["leaky_relu_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_2/strided_slice_2", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_2/Shape", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_2/strided_slice_1", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_2/Shape", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_2/strided_slice", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_2/Shape", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_2/strided_slice_3", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_2/Shape", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_2/Slice/size", "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_2/strided_slice", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_2/strided_slice_1", "conv2d_bias_2/strided_slice_2"]}, {"op": "Sub", "name": "conv2d_bias_2/sub", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_2/strided_slice_3", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_2/Slice", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["leaky_relu_1", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_2/Slice/size"]}, {"op": "Pack", "name": "conv2d_bias_2/Slice_1/begin", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_2/sub", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_2/Slice_1", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["leaky_relu_1", "conv2d_bias_2/Slice_1/begin", "conv2d_bias_2/Slice/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_2/concat", "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}, "input": ["conv2d_bias_2/Slice", "leaky_relu_1", "conv2d_bias_2/Slice_1", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Shape", "name": "conv2d_bias_2/Shape_1", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["conv2d_bias_2/concat"]}, {"op": "StridedSlice", "name": "conv2d_bias_2/strided_slice_9", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_2/Shape_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_2/strided_slice_8", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_2/Shape_1", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_2/strided_slice_7", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_2/Shape_1", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_2/strided_slice_10", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_2/Shape_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_2/Slice_2/size", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_2/strided_slice_7", "conv2d_bias_2/strided_slice_8", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_2/strided_slice_9"]}, {"op": "Sub", "name": "conv2d_bias_2/sub_1", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_2/strided_slice_10", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_2/Slice_2", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_2/concat", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_2/Slice_2/size"]}, {"op": "Pack", "name": "conv2d_bias_2/Slice_3/begin", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_2/sub_1", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_2/Slice_3", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_2/concat", "conv2d_bias_2/Slice_3/begin", "conv2d_bias_2/Slice_2/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_2/concat_1", "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}, "input": ["conv2d_bias_2/Slice_2", "conv2d_bias_2/concat", "conv2d_bias_2/Slice_3", "mul/y"]}, {"op": "Conv2D", "name": "conv2d_bias_2/conv2d", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}, "input": ["conv2d_bias_2/concat_1", "conv2d_bias_2/conv2d_filter"]}, {"op": "BiasAdd", "name": "conv2d_bias_2/bias_add", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_2/conv2d", "conv2d_bias_2/bias_value"]}, {"op": "LeakyRelu", "name": "leaky_relu_2", "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}, "input": ["conv2d_bias_2/bias_add"]}, {"op": "Shape", "name": "conv2d_bias_3/Shape", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["leaky_relu_2"]}, {"op": "StridedSlice", "name": "conv2d_bias_3/strided_slice_2", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_3/Shape", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_3/strided_slice_1", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_3/Shape", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_3/strided_slice", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_3/Shape", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_3/strided_slice_3", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_3/Shape", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_3/Slice/size", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_3/strided_slice", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_3/strided_slice_1", "conv2d_bias_3/strided_slice_2"]}, {"op": "Sub", "name": "conv2d_bias_3/sub", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_3/strided_slice_3", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_3/Slice", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["leaky_relu_2", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_3/Slice/size"]}, {"op": "Pack", "name": "conv2d_bias_3/Slice_1/begin", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_3/sub", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_3/Slice_1", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["leaky_relu_2", "conv2d_bias_3/Slice_1/begin", "conv2d_bias_3/Slice/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_3/concat", "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}, "input": ["conv2d_bias_3/Slice", "leaky_relu_2", "conv2d_bias_3/Slice_1", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Shape", "name": "conv2d_bias_3/Shape_1", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["conv2d_bias_3/concat"]}, {"op": "StridedSlice", "name": "conv2d_bias_3/strided_slice_9", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_3/Shape_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_3/strided_slice_8", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_3/Shape_1", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_3/strided_slice_7", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_3/Shape_1", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_3/strided_slice_10", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_3/Shape_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_3/Slice_2/size", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_3/strided_slice_7", "conv2d_bias_3/strided_slice_8", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_3/strided_slice_9"]}, {"op": "Sub", "name": "conv2d_bias_3/sub_1", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_3/strided_slice_10", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_3/Slice_2", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_3/concat", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_3/Slice_2/size"]}, {"op": "Pack", "name": "conv2d_bias_3/Slice_3/begin", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_3/sub_1", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_3/Slice_3", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_3/concat", "conv2d_bias_3/Slice_3/begin", "conv2d_bias_3/Slice_2/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_3/concat_1", "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}, "input": ["conv2d_bias_3/Slice_2", "conv2d_bias_3/concat", "conv2d_bias_3/Slice_3", "mul/y"]}, {"op": "Conv2D", "name": "conv2d_bias_3/conv2d", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}, "input": ["conv2d_bias_3/concat_1", "conv2d_bias_3/conv2d_filter"]}, {"op": "BiasAdd", "name": "conv2d_bias_3/bias_add", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_3/conv2d", "conv2d_bias_3/bias_value"]}, {"op": "LeakyRelu", "name": "leaky_relu_3", "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}, "input": ["conv2d_bias_3/bias_add"]}, {"op": "Shape", "name": "conv2d_bias_4/Shape", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["leaky_relu_3"]}, {"op": "StridedSlice", "name": "conv2d_bias_4/strided_slice_2", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_4/Shape", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_4/strided_slice_1", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_4/Shape", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_4/strided_slice", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_4/Shape", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_4/strided_slice_3", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_4/Shape", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_4/Slice/size", "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_4/strided_slice", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_4/strided_slice_1", "conv2d_bias_4/strided_slice_2"]}, {"op": "Sub", "name": "conv2d_bias_4/sub", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_4/strided_slice_3", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_4/Slice", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["leaky_relu_3", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_4/Slice/size"]}, {"op": "Pack", "name": "conv2d_bias_4/Slice_1/begin", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_4/sub", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_4/Slice_1", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["leaky_relu_3", "conv2d_bias_4/Slice_1/begin", "conv2d_bias_4/Slice/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_4/concat", "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}, "input": ["conv2d_bias_4/Slice", "leaky_relu_3", "conv2d_bias_4/Slice_1", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Shape", "name": "conv2d_bias_4/Shape_1", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["conv2d_bias_4/concat"]}, {"op": "StridedSlice", "name": "conv2d_bias_4/strided_slice_9", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_4/Shape_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_4/strided_slice_8", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_4/Shape_1", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_4/strided_slice_7", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_4/Shape_1", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_4/strided_slice_10", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_4/Shape_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_4/Slice_2/size", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_4/strided_slice_7", "conv2d_bias_4/strided_slice_8", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_4/strided_slice_9"]}, {"op": "Sub", "name": "conv2d_bias_4/sub_1", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_4/strided_slice_10", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_4/Slice_2", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_4/concat", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_4/Slice_2/size"]}, {"op": "Pack", "name": "conv2d_bias_4/Slice_3/begin", "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_4/sub_1", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_4/Slice_3", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_4/concat", "conv2d_bias_4/Slice_3/begin", "conv2d_bias_4/Slice_2/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_4/concat_1", "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}, "input": ["conv2d_bias_4/Slice_2", "conv2d_bias_4/concat", "conv2d_bias_4/Slice_3", "mul/y"]}, {"op": "Conv2D", "name": "conv2d_bias_4/conv2d", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}, "input": ["conv2d_bias_4/concat_1", "conv2d_bias_4/conv2d_filter"]}, {"op": "BiasAdd", "name": "conv2d_bias_4/bias_add", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_4/conv2d", "conv2d_bias_4/bias_value"]}, {"op": "LeakyRelu", "name": "leaky_relu_4", "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}, "input": ["conv2d_bias_4/bias_add"]}, {"op": "Shape", "name": "conv2d_bias_5/Shape", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["leaky_relu_4"]}, {"op": "StridedSlice", "name": "conv2d_bias_5/strided_slice_2", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_5/Shape", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_5/strided_slice_1", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_5/Shape", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_5/strided_slice", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_5/Shape", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_5/strided_slice_3", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_5/Shape", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_5/Slice/size", "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_5/strided_slice", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_5/strided_slice_1", "conv2d_bias_5/strided_slice_2"]}, {"op": "Sub", "name": "conv2d_bias_5/sub", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_5/strided_slice_3", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_5/Slice", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["leaky_relu_4", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_5/Slice/size"]}, {"op": "Pack", "name": "conv2d_bias_5/Slice_1/begin", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_5/sub", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_5/Slice_1", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["leaky_relu_4", "conv2d_bias_5/Slice_1/begin", "conv2d_bias_5/Slice/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_5/concat", "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}, "input": ["conv2d_bias_5/Slice", "leaky_relu_4", "conv2d_bias_5/Slice_1", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Shape", "name": "conv2d_bias_5/Shape_1", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["conv2d_bias_5/concat"]}, {"op": "StridedSlice", "name": "conv2d_bias_5/strided_slice_9", "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_5/Shape_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_9/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_5/strided_slice_8", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_5/Shape_1", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_5/strided_slice_7", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_5/Shape_1", "conv2d_bias_7/strided_slice_7/stack", "conv2d_bias_7/strided_slice_7/stack_1", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "StridedSlice", "name": "conv2d_bias_5/strided_slice_10", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_5/Shape_1", "conv2d_bias_7/strided_slice_8/stack_1", "conv2d_bias_7/strided_slice_9/stack", "conv2d_bias_7/strided_slice_7/stack_1"]}, {"op": "Pack", "name": "conv2d_bias_5/Slice_2/size", "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_5/strided_slice_7", "conv2d_bias_5/strided_slice_8", "conv2d_bias_7/Slice_2/size/2", "conv2d_bias_5/strided_slice_9"]}, {"op": "Sub", "name": "conv2d_bias_5/sub_1", "attr": {"T": {"type": "DT_INT32"}}, "input": ["conv2d_bias_5/strided_slice_10", "conv2d_bias_7/Slice_2/size/2"]}, {"op": "Slice", "name": "conv2d_bias_5/Slice_2", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_5/concat", "conv2d_bias_7/Slice_2/begin", "conv2d_bias_5/Slice_2/size"]}, {"op": "Pack", "name": "conv2d_bias_5/Slice_3/begin", "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "input": ["conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_7/Slice_3/begin/0", "conv2d_bias_5/sub_1", "conv2d_bias_7/Slice_3/begin/0"]}, {"op": "Slice", "name": "conv2d_bias_5/Slice_3", "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}, "input": ["conv2d_bias_5/concat", "conv2d_bias_5/Slice_3/begin", "conv2d_bias_5/Slice_2/size"]}, {"op": "ConcatV2", "name": "conv2d_bias_5/concat_1", "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "input": ["conv2d_bias_5/Slice_2", "conv2d_bias_5/concat", "conv2d_bias_5/Slice_3", "mul/y"]}, {"op": "Conv2D", "name": "conv2d_bias_5/conv2d", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}}, "input": ["conv2d_bias_5/concat_1", "conv2d_bias_5/conv2d_filter"]}, {"op": "BiasAdd", "name": "conv2d_bias_5/bias_add", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "input": ["conv2d_bias_5/conv2d", "conv2d_bias_5/bias_value"]}, {"op": "LeakyRelu", "name": "leaky_relu_5", "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}, "input": ["conv2d_bias_5/bias_add"]}, {"op": "Shape", "name": "conv2d_bias_7/Shape", "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "input": ["leaky_relu_5"]}, {"op": "StridedSlice", "name": "conv2d_bias_7/strided_slice_2", "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "input": ["conv2d_bias_7/Shape", "conv2d_bias_7/strided_slice_9/stack", 