{"format": "graph-model", "convertedBy": "TensorFlow.js Converter v1.0.1", "weightsManifest": [{"weights": [{"shape": [], "dtype": "float32", "name": "output/y"}, {"shape": [], "dtype": "float32", "name": "output/Minimum/y"}, {"shape": [256], "dtype": "float32", "name": "conv2d_bias_5/bias_value"}, {"shape": [3, 3, 128, 256], "dtype": "float32", "name": "conv2d_bias_5/conv2d_filter"}, {"shape": [128], "dtype": "float32", "name": "conv2d_bias_4/bias_value"}, {"shape": [3, 3, 128, 128], "dtype": "float32", "name": "conv2d_bias_4/conv2d_filter"}, {"shape": [128], "dtype": "float32", "name": "conv2d_bias_3/bias_value"}, {"shape": [3, 3, 64, 128], "dtype": "float32", "name": "conv2d_bias_3/conv2d_filter"}, {"shape": [64], "dtype": "float32", "name": "conv2d_bias_2/bias_value"}, {"shape": [3, 3, 32, 64], "dtype": "float32", "name": "conv2d_bias_2/conv2d_filter"}, {"shape": [32], "dtype": "float32", "name": "conv2d_bias_1/bias_value"}, {"shape": [3, 3, 16, 32], "dtype": "float32", "name": "conv2d_bias_1/conv2d_filter"}, {"shape": [16], "dtype": "float32", "name": "conv2d_bias_0/bias_value"}, {"shape": [3, 3, 3, 16], "dtype": "float32", "name": "conv2d_bias_0/conv2d_filter"}, {"shape": [4, 4, 3, 256], "dtype": "float32", "name": "upconv/conv2d_transpose_filter"}, {"shape": [], "dtype": "int32", "name": "upconv/conv2d_transpose/output_shape/3"}, {"shape": [], "dtype": "int32", "name": "upconv/mul/y"}, {"shape": [1], "dtype": "int32", "name": "upconv/strided_slice/stack_1"}, {"shape": [1], "dtype": "int32", "name": "upconv/strided_slice_2/stack_1"}, {"shape": [1], "dtype": "int32", "name": "upconv/strided_slice_1/stack_1"}, {"shape": [1], "dtype": "int32", "name": "upconv/strided_slice/stack"}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"node": [{"attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Placeholder", "name": "input"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "output/y"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "output/Minimum/y"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_5/bias_value"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_5/conv2d_filter"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_4/bias_value"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_4/conv2d_filter"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_3/bias_value"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_3/conv2d_filter"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_2/bias_value"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_2/conv2d_filter"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_1/bias_value"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_1/conv2d_filter"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "16"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_0/bias_value"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "conv2d_bias_0/conv2d_filter"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}}, "op": "Const", "name": "upconv/conv2d_transpose_filter"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "upconv/conv2d_transpose/output_shape/3"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "upconv/mul/y"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "upconv/strided_slice/stack_1"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "upconv/strided_slice_2/stack_1"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "upconv/strided_slice_1/stack_1"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}, "op": "Const", "name": "upconv/strided_slice/stack"}, {"input": ["input", "conv2d_bias_0/conv2d_filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "op": "Conv2D", "name": "conv2d_bias_0/conv2d"}, {"input": ["conv2d_bias_0/conv2d", "conv2d_bias_0/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "op": "BiasAdd", "name": "conv2d_bias_0/bias_add"}, {"input": ["conv2d_bias_0/bias_add"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_0"}, {"input": ["leaky_relu_0", "conv2d_bias_1/conv2d_filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "op": "Conv2D", "name": "conv2d_bias_1/conv2d"}, {"input": ["conv2d_bias_1/conv2d", "conv2d_bias_1/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "op": "BiasAdd", "name": "conv2d_bias_1/bias_add"}, {"input": ["conv2d_bias_1/bias_add"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_1"}, {"input": ["leaky_relu_1", "conv2d_bias_2/conv2d_filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "op": "Conv2D", "name": "conv2d_bias_2/conv2d"}, {"input": ["conv2d_bias_2/conv2d", "conv2d_bias_2/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "op": "BiasAdd", "name": "conv2d_bias_2/bias_add"}, {"input": ["conv2d_bias_2/bias_add"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_2"}, {"input": ["leaky_relu_2", "conv2d_bias_3/conv2d_filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "op": "Conv2D", "name": "conv2d_bias_3/conv2d"}, {"input": ["conv2d_bias_3/conv2d", "conv2d_bias_3/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "op": "BiasAdd", "name": "conv2d_bias_3/bias_add"}, {"input": ["conv2d_bias_3/bias_add"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_3"}, {"input": ["leaky_relu_3", "conv2d_bias_4/conv2d_filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "op": "Conv2D", "name": "conv2d_bias_4/conv2d"}, {"input": ["conv2d_bias_4/conv2d", "conv2d_bias_4/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "op": "BiasAdd", "name": "conv2d_bias_4/bias_add"}, {"input": ["conv2d_bias_4/bias_add"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_4"}, {"input": ["leaky_relu_4", "conv2d_bias_5/conv2d_filter"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "op": "Conv2D", "name": "conv2d_bias_5/conv2d"}, {"input": ["conv2d_bias_5/conv2d", "conv2d_bias_5/bias_value"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}, "op": "BiasAdd", "name": "conv2d_bias_5/bias_add"}, {"input": ["conv2d_bias_5/bias_add"], "attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_5"}, {"input": ["leaky_relu_5"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "op": "Shape", "name": "upconv/Shape"}, {"input": ["upconv/Shape", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}, "op": "StridedSlice", "name": "upconv/strided_slice_2"}, {"input": ["upconv/Shape", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "op": "StridedSlice", "name": "upconv/strided_slice_1"}, {"input": ["upconv/Shape", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}, "op": "StridedSlice", "name": "upconv/strided_slice"}, {"input": ["upconv/strided_slice_2", "upconv/mul/y"], "attr": {"T": {"type": "DT_INT32"}}, "op": "Mul", "name": "upconv/mul_1"}, {"input": ["upconv/strided_slice_1", "upconv/mul/y"], "attr": {"T": {"type": "DT_INT32"}}, "op": "Mul", "name": "upconv/mul"}, {"input": ["upconv/strided_slice", "upconv/mul", "upconv/mul_1", "upconv/conv2d_transpose/output_shape/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}, "op": "Pack", "name": "upconv/conv2d_transpose/output_shape"}, {"input": ["upconv/conv2d_transpose/output_shape", "upconv/conv2d_transpose_filter", "leaky_relu_5"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "op": "Conv2DBackpropInput", "name": "upconv/conv2d_transpose"}, {"input": ["upconv/conv2d_transpose", "output/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}, "op": "Minimum", "name": "output/Minimum"}, {"input": ["output/Minimum", "output/y"], "attr": {"T": {"type": "DT_FLOAT"}}, "op": "Maximum", "name": "output"}, {"input": ["output"], "attr": {"T": {"list": {"type": ["DT_FLOAT"]}}}, "op": "Identity", "name": "Identity"}], "versions": {}, "library": {}}, "generatedBy": "2.0.0-dev20190322"}